InformationRegisters/ТабельСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТабельСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачалоСменыАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецСменыАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТабельСотрудников/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	Элементы.ФормаУдалитьЗапись.Доступность = РольДоступна("РедактированиеРегистраУчетаРабочегоВремени");
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	//
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Не заполнен конец смены'");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонецСмены");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("ТекущаяСтрока", Элементы.Список.ТекущаяСтрока);
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьЗаписьЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, "Удалить безвозвратно выбранную запись? Восстановление записи будет невозможным!", РежимДиалогаВопрос.ДаНет)
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЗаписьСервер(ДополнительныеПараметры.ТекущаяСтрока);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьСервер(КлючЗаписиРегистра)

	МенеджерЗаписи = РегистрыСведений.ТабельСотрудников.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючЗаписиРегистра);
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияПотолкиКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияПотолкиКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
			ЭтаФорма.Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;	
	// Конец ПодключаемоеОборудование
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСотрудников = ПолучитьСотрудникаПоШтрихкоду(Данные.Штрихкод);
	Если ЗначениеЗаполнено(МассивСотрудников) Тогда
		Если МассивСотрудников.Количество() = 1 Тогда
			ДобавитьЗаписьВТабель(МассивСотрудников[0]);
		Иначе
			//ПараметрыФормы = Новый Структура("МассивСсылок", МассивСсылок);
			//ОписаниеОповещения = Новый ОписаниеОповещения("ВыборДокументаИзСпискаЗавершение", ЭтотОбъект);
			//ОткрытьФорму("ОбщаяФорма.ФормаСпискаДокументовПоСсылкам", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
		КонецЕсли;
	Иначе 
		ПоказатьОповещениеПользователя("Не найден",
		                       , 
                               "Сотрудник по данному штрихкоду не найден", 
                               БиблиотекаКартинок.Важно, 
                               СтатусОповещенияПользователя.Важное);
		//ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСотрудникаПоШтрихкоду(Штрихкод)
	
	Результат = ШтрихкодированиеПотолкиКлиент.ОбработатьШтрихкод(Штрихкод,1);
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура")  И Результат.Свойство("Сотрудник") Тогда
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(Результат.Сотрудник);
		Возврат МассивСотрудников;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ДобавитьЗаписьВТабель(Сотрудник)
	
	МенеджерЗаписи = РегистрыСведений.ТабельСотрудников.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сотрудник = Сотрудник;
	МенеджерЗаписи.Период = НачалоДня(ТекущаяДата());
	МенеджерЗаписи.Прочитать();

	Если НЕ МенеджерЗаписи.Выбран() Тогда
	
		//нет записи, это время прихода на работу
		МенеджерЗаписи.Сотрудник = Сотрудник;	
		МенеджерЗаписи.Период = НачалоДня(ТекущаяДата());
		МенеджерЗаписи.НачалоСмены = ТекущаяДата();
		МенеджерЗаписи.Время = 0;
	
	Иначе
	
		// Есть запись правим её, это время ухода с работы
		МенеджерЗаписи.Сотрудник = Сотрудник;	
		МенеджерЗаписи.Период = НачалоДня(ТекущаяДата());
		МенеджерЗаписи.КонецСмены = ТекущаяДата();
		МенеджерЗаписи.Время = (МенеджерЗаписи.КонецСмены - МенеджерЗаписи.НачалоСмены)/60;
	
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
КонецПроцедуры
